       01  MAP1I.
           02  FILLER PIC X(12).
           02  STUNUML    COMP  PIC  S9(4).
           02  STUNUMF    PICTURE X.
           02  FILLER REDEFINES STUNUMF.
             03 STUNUMA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  STUNUMI  PIC X(7).
           02  STUCR1AL    COMP  PIC  S9(4).
           02  STUCR1AF    PICTURE X.
           02  FILLER REDEFINES STUCR1AF.
             03 STUCR1AA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  STUCR1AI  PIC X(4).
           02  STUCR1BL    COMP  PIC  S9(4).
           02  STUCR1BF    PICTURE X.
           02  FILLER REDEFINES STUCR1BF.
             03 STUCR1BA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  STUCR1BI  PIC X(4).
           02  STUCR2AL    COMP  PIC  S9(4).
           02  STUCR2AF    PICTURE X.
           02  FILLER REDEFINES STUCR2AF.
             03 STUCR2AA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  STUCR2AI  PIC X(4).
           02  STUCR2BL    COMP  PIC  S9(4).
           02  STUCR2BF    PICTURE X.
           02  FILLER REDEFINES STUCR2BF.
             03 STUCR2BA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  STUCR2BI  PIC X(4).
           02  STUCR3AL    COMP  PIC  S9(4).
           02  STUCR3AF    PICTURE X.
           02  FILLER REDEFINES STUCR3AF.
             03 STUCR3AA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  STUCR3AI  PIC X(4).
           02  STUCR3BL    COMP  PIC  S9(4).
           02  STUCR3BF    PICTURE X.
           02  FILLER REDEFINES STUCR3BF.
             03 STUCR3BA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  STUCR3BI  PIC X(4).
           02  STUCR4AL    COMP  PIC  S9(4).
           02  STUCR4AF    PICTURE X.
           02  FILLER REDEFINES STUCR4AF.
             03 STUCR4AA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  STUCR4AI  PIC X(4).
           02  STUCR4BL    COMP  PIC  S9(4).
           02  STUCR4BF    PICTURE X.
           02  FILLER REDEFINES STUCR4BF.
             03 STUCR4BA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  STUCR4BI  PIC X(4).
           02  STUCR5AL    COMP  PIC  S9(4).
           02  STUCR5AF    PICTURE X.
           02  FILLER REDEFINES STUCR5AF.
             03 STUCR5AA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  STUCR5AI  PIC X(4).
           02  STUCR5BL    COMP  PIC  S9(4).
           02  STUCR5BF    PICTURE X.
           02  FILLER REDEFINES STUCR5BF.
             03 STUCR5BA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  STUCR5BI  PIC X(4).
           02  STUNAMEL    COMP  PIC  S9(4).
           02  STUNAMEF    PICTURE X.
           02  FILLER REDEFINES STUNAMEF.
             03 STUNAMEA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  STUNAMEI  PIC X(20).
           02  STUADD1L    COMP  PIC  S9(4).
           02  STUADD1F    PICTURE X.
           02  FILLER REDEFINES STUADD1F.
             03 STUADD1A    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  STUADD1I  PIC X(20).
           02  STUADD2L    COMP  PIC  S9(4).
           02  STUADD2F    PICTURE X.
           02  FILLER REDEFINES STUADD2F.
             03 STUADD2A    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  STUADD2I  PIC X(20).
           02  STUADD3L    COMP  PIC  S9(4).
           02  STUADD3F    PICTURE X.
           02  FILLER REDEFINES STUADD3F.
             03 STUADD3A    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  STUADD3I  PIC X(20).
           02  STUPOS1L    COMP  PIC  S9(4).
           02  STUPOS1F    PICTURE X.
           02  FILLER REDEFINES STUPOS1F.
             03 STUPOS1A    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  STUPOS1I  PIC X(4).
           02  STUPOS2L    COMP  PIC  S9(4).
           02  STUPOS2F    PICTURE X.
           02  FILLER REDEFINES STUPOS2F.
             03 STUPOS2A    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  STUPOS2I  PIC X(3).
           02  STUPHNLL    COMP  PIC  S9(4).
           02  STUPHNLF    PICTURE X.
           02  FILLER REDEFINES STUPHNLF.
             03 STUPHNLA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  STUPHNLI  PIC X(18).
           02  MSGL    COMP  PIC  S9(4).
           02  MSGF    PICTURE X.
           02  FILLER REDEFINES MSGF.
             03 MSGA    PICTURE X.
           02  FILLER   PICTURE X(2).
           02  MSGI  PIC X(40).
       01  MAP1O REDEFINES MAP1I.
           02  FILLER PIC X(12).
           02  FILLER PICTURE X(3).
           02  STUNUMC    PICTURE X.
           02  STUNUMH    PICTURE X.
           02  STUNUMO  PIC X(7).
           02  FILLER PICTURE X(3).
           02  STUCR1AC    PICTURE X.
           02  STUCR1AH    PICTURE X.
           02  STUCR1AO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  STUCR1BC    PICTURE X.
           02  STUCR1BH    PICTURE X.
           02  STUCR1BO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  STUCR2AC    PICTURE X.
           02  STUCR2AH    PICTURE X.
           02  STUCR2AO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  STUCR2BC    PICTURE X.
           02  STUCR2BH    PICTURE X.
           02  STUCR2BO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  STUCR3AC    PICTURE X.
           02  STUCR3AH    PICTURE X.
           02  STUCR3AO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  STUCR3BC    PICTURE X.
           02  STUCR3BH    PICTURE X.
           02  STUCR3BO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  STUCR4AC    PICTURE X.
           02  STUCR4AH    PICTURE X.
           02  STUCR4AO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  STUCR4BC    PICTURE X.
           02  STUCR4BH    PICTURE X.
           02  STUCR4BO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  STUCR5AC    PICTURE X.
           02  STUCR5AH    PICTURE X.
           02  STUCR5AO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  STUCR5BC    PICTURE X.
           02  STUCR5BH    PICTURE X.
           02  STUCR5BO  PIC X(4).
           02  FILLER PICTURE X(3).
           02  STUNAMEC    PICTURE X.
           02  STUNAMEH    PICTURE X.
           02  STUNAMEO  PIC X(20).
           02  FILLER PICTURE X(3).
           02  STUADD1C    PICTURE X.
           02  STUADD1H    PICTURE X.
           02  STUADD1O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  STUADD2C    PICTURE X.
           02  STUADD2H    PICTURE X.
           02  STUADD2O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  STUADD3C    PICTURE X.
           02  STUADD3H    PICTURE X.
           02  STUADD3O  PIC X(20).
           02  FILLER PICTURE X(3).
           02  STUPOS1C    PICTURE X.
           02  STUPOS1H    PICTURE X.
           02  STUPOS1O  PIC X(4).
           02  FILLER PICTURE X(3).
           02  STUPOS2C    PICTURE X.
           02  STUPOS2H    PICTURE X.
           02  STUPOS2O  PIC X(3).
           02  FILLER PICTURE X(3).
           02  STUPHNLC    PICTURE X.
           02  STUPHNLH    PICTURE X.
           02  STUPHNLO  PIC X(18).
           02  FILLER PICTURE X(3).
           02  MSGC    PICTURE X.
           02  MSGH    PICTURE X.
           02  MSGO  PIC X(40).