       01 STU-RESP.
            05 STATUS-CODE PIC X.
            05 MSG         PIC X(60).
            05 STU-DATA.
                10 STUNUM   PIC X(7).
                10 STUNAME  PIC X(20).
                10 ADDR1    PIC X(20).
                10 ADDR2    PIC X(20).
                10 ADDR3    PIC X(20).
                10 POSTCODE PIC X(6).
                10 PHONENUM PIC X(10).